Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/adc.h
#define ADC_CHNCFG4_TRGSRC0_Pos               _UINT32_(0)                                          /* (ADC_CHNCFG4) Channel 0 Trigger Source Position */
#define ADC_CHNCFG4_TRGSRC0_Msk               (_UINT32_(0xF) << ADC_CHNCFG4_TRGSRC0_Pos)           /* (ADC_CHNCFG4) Channel 0 Trigger Source Mask */
#define ADC_CHNCFG4_TRGSRC0(value)            (ADC_CHNCFG4_TRGSRC0_Msk & (_UINT32_(value) << ADC_CHNCFG4_TRGSRC0_Pos)) /* Assigment of value for TRGSRC0 in the ADC_CHNCFG4 register */
#define   ADC_CHNCFG4_TRGSRC0_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG4) No Trigger (NOP)  */
#define   ADC_CHNCFG4_TRGSRC0_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG4) Global Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC0_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG4) Global Level Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC0_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG4) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG4_TRGSRC0_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG4) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 0  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 1  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 2  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 3  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 4  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 5  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 6  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 7  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 8  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 9  */
#define   ADC_CHNCFG4_TRGSRC0_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 10  */
#define ADC_CHNCFG4_TRGSRC0_NO_TRIGGER        (ADC_CHNCFG4_TRGSRC0_NO_TRIGGER_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) No Trigger (NOP) Position  */
#define ADC_CHNCFG4_TRGSRC0_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG4_TRGSRC0_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) Global Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC0_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG4_TRGSRC0_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) Global Level Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC0_SCAN_TRIGGER      (ADC_CHNCFG4_TRGSRC0_SCAN_TRIGGER_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG4_TRGSRC0_SYNC_TRIGGER      (ADC_CHNCFG4_TRGSRC0_SYNC_TRIGGER_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER0       (ADC_CHNCFG4_TRGSRC0_EVENT_USER0_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER1       (ADC_CHNCFG4_TRGSRC0_EVENT_USER1_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER2       (ADC_CHNCFG4_TRGSRC0_EVENT_USER2_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER3       (ADC_CHNCFG4_TRGSRC0_EVENT_USER3_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER4       (ADC_CHNCFG4_TRGSRC0_EVENT_USER4_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER5       (ADC_CHNCFG4_TRGSRC0_EVENT_USER5_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER6       (ADC_CHNCFG4_TRGSRC0_EVENT_USER6_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER7       (ADC_CHNCFG4_TRGSRC0_EVENT_USER7_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER8       (ADC_CHNCFG4_TRGSRC0_EVENT_USER8_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER9       (ADC_CHNCFG4_TRGSRC0_EVENT_USER9_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG4_TRGSRC0_EVENT_USER10      (ADC_CHNCFG4_TRGSRC0_EVENT_USER10_Val << ADC_CHNCFG4_TRGSRC0_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG4_TRGSRC1_Pos               _UINT32_(4)                                          /* (ADC_CHNCFG4) Channel 1 Trigger Source Position */
#define ADC_CHNCFG4_TRGSRC1_Msk               (_UINT32_(0xF) << ADC_CHNCFG4_TRGSRC1_Pos)           /* (ADC_CHNCFG4) Channel 1 Trigger Source Mask */
#define ADC_CHNCFG4_TRGSRC1(value)            (ADC_CHNCFG4_TRGSRC1_Msk & (_UINT32_(value) << ADC_CHNCFG4_TRGSRC1_Pos)) /* Assigment of value for TRGSRC1 in the ADC_CHNCFG4 register */
#define   ADC_CHNCFG4_TRGSRC1_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG4) No Trigger (NOP)  */
#define   ADC_CHNCFG4_TRGSRC1_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG4) Global Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC1_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG4) Global Level Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC1_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG4) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG4_TRGSRC1_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG4) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 0  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 1  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 2  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 3  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 4  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 5  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 6  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 7  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 8  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 9  */
#define   ADC_CHNCFG4_TRGSRC1_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 10  */
#define ADC_CHNCFG4_TRGSRC1_NO_TRIGGER        (ADC_CHNCFG4_TRGSRC1_NO_TRIGGER_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) No Trigger (NOP) Position  */
#define ADC_CHNCFG4_TRGSRC1_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG4_TRGSRC1_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) Global Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC1_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG4_TRGSRC1_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) Global Level Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC1_SCAN_TRIGGER      (ADC_CHNCFG4_TRGSRC1_SCAN_TRIGGER_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG4_TRGSRC1_SYNC_TRIGGER      (ADC_CHNCFG4_TRGSRC1_SYNC_TRIGGER_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER0       (ADC_CHNCFG4_TRGSRC1_EVENT_USER0_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER1       (ADC_CHNCFG4_TRGSRC1_EVENT_USER1_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER2       (ADC_CHNCFG4_TRGSRC1_EVENT_USER2_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER3       (ADC_CHNCFG4_TRGSRC1_EVENT_USER3_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER4       (ADC_CHNCFG4_TRGSRC1_EVENT_USER4_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER5       (ADC_CHNCFG4_TRGSRC1_EVENT_USER5_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER6       (ADC_CHNCFG4_TRGSRC1_EVENT_USER6_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER7       (ADC_CHNCFG4_TRGSRC1_EVENT_USER7_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER8       (ADC_CHNCFG4_TRGSRC1_EVENT_USER8_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER9       (ADC_CHNCFG4_TRGSRC1_EVENT_USER9_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG4_TRGSRC1_EVENT_USER10      (ADC_CHNCFG4_TRGSRC1_EVENT_USER10_Val << ADC_CHNCFG4_TRGSRC1_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG4_TRGSRC2_Pos               _UINT32_(8)                                          /* (ADC_CHNCFG4) Channel 2 Trigger Source Position */
#define ADC_CHNCFG4_TRGSRC2_Msk               (_UINT32_(0xF) << ADC_CHNCFG4_TRGSRC2_Pos)           /* (ADC_CHNCFG4) Channel 2 Trigger Source Mask */
#define ADC_CHNCFG4_TRGSRC2(value)            (ADC_CHNCFG4_TRGSRC2_Msk & (_UINT32_(value) << ADC_CHNCFG4_TRGSRC2_Pos)) /* Assigment of value for TRGSRC2 in the ADC_CHNCFG4 register */
#define   ADC_CHNCFG4_TRGSRC2_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG4) No Trigger (NOP)  */
#define   ADC_CHNCFG4_TRGSRC2_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG4) Global Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC2_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG4) Global Level Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC2_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG4) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG4_TRGSRC2_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG4) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 0  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 1  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 2  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 3  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 4  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 5  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 6  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 7  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 8  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 9  */
#define   ADC_CHNCFG4_TRGSRC2_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 10  */
#define ADC_CHNCFG4_TRGSRC2_NO_TRIGGER        (ADC_CHNCFG4_TRGSRC2_NO_TRIGGER_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) No Trigger (NOP) Position  */
#define ADC_CHNCFG4_TRGSRC2_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG4_TRGSRC2_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) Global Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC2_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG4_TRGSRC2_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) Global Level Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC2_SCAN_TRIGGER      (ADC_CHNCFG4_TRGSRC2_SCAN_TRIGGER_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG4_TRGSRC2_SYNC_TRIGGER      (ADC_CHNCFG4_TRGSRC2_SYNC_TRIGGER_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER0       (ADC_CHNCFG4_TRGSRC2_EVENT_USER0_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER1       (ADC_CHNCFG4_TRGSRC2_EVENT_USER1_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER2       (ADC_CHNCFG4_TRGSRC2_EVENT_USER2_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER3       (ADC_CHNCFG4_TRGSRC2_EVENT_USER3_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER4       (ADC_CHNCFG4_TRGSRC2_EVENT_USER4_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER5       (ADC_CHNCFG4_TRGSRC2_EVENT_USER5_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER6       (ADC_CHNCFG4_TRGSRC2_EVENT_USER6_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER7       (ADC_CHNCFG4_TRGSRC2_EVENT_USER7_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER8       (ADC_CHNCFG4_TRGSRC2_EVENT_USER8_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER9       (ADC_CHNCFG4_TRGSRC2_EVENT_USER9_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG4_TRGSRC2_EVENT_USER10      (ADC_CHNCFG4_TRGSRC2_EVENT_USER10_Val << ADC_CHNCFG4_TRGSRC2_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG4_TRGSRC3_Pos               _UINT32_(12)                                         /* (ADC_CHNCFG4) Channel 3 Trigger Source Position */
#define ADC_CHNCFG4_TRGSRC3_Msk               (_UINT32_(0xF) << ADC_CHNCFG4_TRGSRC3_Pos)           /* (ADC_CHNCFG4) Channel 3 Trigger Source Mask */
#define ADC_CHNCFG4_TRGSRC3(value)            (ADC_CHNCFG4_TRGSRC3_Msk & (_UINT32_(value) << ADC_CHNCFG4_TRGSRC3_Pos)) /* Assigment of value for TRGSRC3 in the ADC_CHNCFG4 register */
#define   ADC_CHNCFG4_TRGSRC3_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG4) No Trigger (NOP)  */
#define   ADC_CHNCFG4_TRGSRC3_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG4) Global Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC3_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG4) Global Level Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC3_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG4) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG4_TRGSRC3_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG4) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 0  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 1  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 2  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 3  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 4  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 5  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 6  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 7  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 8  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 9  */
#define   ADC_CHNCFG4_TRGSRC3_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 10  */
#define ADC_CHNCFG4_TRGSRC3_NO_TRIGGER        (ADC_CHNCFG4_TRGSRC3_NO_TRIGGER_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) No Trigger (NOP) Position  */
#define ADC_CHNCFG4_TRGSRC3_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG4_TRGSRC3_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) Global Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC3_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG4_TRGSRC3_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) Global Level Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC3_SCAN_TRIGGER      (ADC_CHNCFG4_TRGSRC3_SCAN_TRIGGER_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG4_TRGSRC3_SYNC_TRIGGER      (ADC_CHNCFG4_TRGSRC3_SYNC_TRIGGER_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER0       (ADC_CHNCFG4_TRGSRC3_EVENT_USER0_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER1       (ADC_CHNCFG4_TRGSRC3_EVENT_USER1_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER2       (ADC_CHNCFG4_TRGSRC3_EVENT_USER2_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER3       (ADC_CHNCFG4_TRGSRC3_EVENT_USER3_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER4       (ADC_CHNCFG4_TRGSRC3_EVENT_USER4_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER5       (ADC_CHNCFG4_TRGSRC3_EVENT_USER5_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER6       (ADC_CHNCFG4_TRGSRC3_EVENT_USER6_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER7       (ADC_CHNCFG4_TRGSRC3_EVENT_USER7_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER8       (ADC_CHNCFG4_TRGSRC3_EVENT_USER8_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER9       (ADC_CHNCFG4_TRGSRC3_EVENT_USER9_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG4_TRGSRC3_EVENT_USER10      (ADC_CHNCFG4_TRGSRC3_EVENT_USER10_Val << ADC_CHNCFG4_TRGSRC3_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG4_TRGSRC4_Pos               _UINT32_(16)                                         /* (ADC_CHNCFG4) Channel 4 Trigger Source Position */
#define ADC_CHNCFG4_TRGSRC4_Msk               (_UINT32_(0xF) << ADC_CHNCFG4_TRGSRC4_Pos)           /* (ADC_CHNCFG4) Channel 4 Trigger Source Mask */
#define ADC_CHNCFG4_TRGSRC4(value)            (ADC_CHNCFG4_TRGSRC4_Msk & (_UINT32_(value) << ADC_CHNCFG4_TRGSRC4_Pos)) /* Assigment of value for TRGSRC4 in the ADC_CHNCFG4 register */
#define   ADC_CHNCFG4_TRGSRC4_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG4) No Trigger (NOP)  */
#define   ADC_CHNCFG4_TRGSRC4_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG4) Global Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC4_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG4) Global Level Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC4_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG4) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG4_TRGSRC4_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG4) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 0  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 1  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 2  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 3  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 4  */
